print(5)
print(type(5)) #int - integer (целое число)
print(5 ** 5) # // - целочисленное деление, / - деление обычное, % - нахождение остатка от деления, ** - возведение в степень
print (type(2.0))
print (5+5.0)
# типы данных: изменяемые, неизменяемые. числа - неизменяемые
print('Hello, world!')
print(type('hello wordl')) #string - строка (строковый тип данных, текст)
print("'hello world'")
print('hello ' + " World") #concatenate
#вычитать строки нельзя. единственная допустимая операция со строками - сложение!
print ("2" + "2")
print(type(True), type(False)) # boolean - логический тип данных
print(5 > 10, 10 > 3)
print(5 == 5) # проверка двух объектов на равеноство
print(5 != 3) # != - не равны
print(5 > 4 and 5 == 5) # and - строгий оператор (хотя бы одно false - в ответе будет false)
print(4 != 4 or 4 == 3) # or - не строгий оператор (хотя бы одно true - в ответе будет true)
print(10 < 20 or 20 < 10)
print(float("555444"))